[
  {
    "date": "2026-01-09",
    "listening_topic": "L'Étranger d'Albert Camus",
    "reading_topic": "La Mécanique Quantique",
    "audio_url": "https://drive.google.com/uc?id=1HbXVIMNjU7cHk3Slkpo3-MtPs8WT6Ap5&export=download",
    "description": "# La Mécanique Quantique (A2)\n\n## Section 1: Le Texte\n\nSilence ! Asseyez-vous tout de suite. Vous êtes en retard et votre niveau est médiocre. Aujourd'hui, nous étudions un sujet très difficile pour vos petits cerveaux : **la mécanique quantique**. Écoutez bien, je ne répète pas.\n\nLa physique classique étudie les grosses choses, comme les voitures ou les planètes. Mais **la mécanique quantique** étudie le monde microscopique : **l'atome** et **l'électron**. Dans ce monde, les règles changent. Une chose peut être une **particule** (solide) et une **onde** (fluide) en même temps. C'est la dualité.\n\nEn mathématiques, on ne peut pas calculer la position exacte de l'électron. C'est impossible. Nous utilisons donc **la probabilité**. On calcule où l'objet *peut* être. C'est **le principe d'incertitude**. Vous comprenez ? Probablement pas.\n\nIl y a aussi une expérience célèbre. Imaginez un chat dans une boîte fermée. Selon cette théorie, le chat est vivant et mort à la fois. C'est un état de **superposition**. Quand on ouvre la boîte, le chat devient vivant OU mort. C'est bizarre, n'est-ce pas ?\n\nEnfin, **l'énergie** ne coule pas comme de l'eau. Elle voyage en petits paquets. On appelle ces paquets des **quanta**. Maintenant, arrêtez de pleurer et sortez vos calculatrices !\n\n## Section 2: Laboratoire de Vocabulaire\n\n*   **La mécanique quantique** (n.f.): Quantum mechanics (Physics of the very small).\n*   **Un atome** (n.m.): An atom (Basic unit of matter).\n*   **Un électron** (n.m.): An electron (Subatomic particle with negative charge).\n*   **Une particule** (n.f.): A particle (A minute portion of matter).\n*   **Une onde** (n.f.): A wave (Oscillation/vibration that transfers energy).\n*   **La probabilité** (n.f.): Probability (The math of chance).\n*   **Le principe d'incertitude** (exp.): The uncertainty principle (Limit to precision).\n*   **La superposition** (n.f.): Superposition (Being in multiple states at once).\n*   **L'énergie** (n.f.): Energy.\n*   **Un quanta** (n.m.): A quantum (Discrete packet of energy).\n\n## Section 3: Rappel Actif (Active Recall)\n\n1. Dans le monde quantique, une chose peut être une particule et une __________ en même temps.\n2. Pour calculer la position d'un objet microscopique, nous utilisons la __________.\n3. Dans l'expérience de la boîte, le chat est dans un état de __________."
  },
  {
    "date": "2026-01-09",
    "listening_topic": "La Thermodynamique (Thermodynamics)",
    "reading_topic": "L'Étranger by Albert Camus",
    "audio_url": "https://drive.google.com/uc?id=1XNdfStmYMLLic6wLDsSb2nZSEuRoz0Gv&export=download",
    "description": "# L'Étranger by Albert Camus (A2)\n\n## Section 1: Le Texte\n\nSilence ! Asseyez-vous tout de suite. Vous pensez que ce livre est de la littérature ? C’est faux. Pour un vrai scientifique, *L’Étranger* est une observation de laboratoire. Meursault n’est pas un homme. C’est une simple **masse** physique.\n\nAnalysez la première partie. J'observe la première loi de Newton : le principe de **l’inertie**. Un objet reste au repos si aucune **force** ne touche cet objet. Meursault est comme ça. Sa mère est morte ? Il ne change pas. Il n’a pas d’**accélération**. Il mange, il dort, il va travailler. Marie pose des questions sur l'amour, mais Meursault n'a pas de **vecteur** ni de direction. Il est passif.\n\nEnsuite, regardez le meurtre sur la plage. Ce n'est pas de la psychologie, c'est de l'**optique** ! Le soleil est une **source d’énergie** très puissante. La **température** monte. La lumière frappe le couteau de l'Arabe. C’est une **réflexion** directe dans les yeux de Meursault. Son équilibre est brisé par cette énergie externe. Il tire quatre fois. C'est une réaction mécanique à la **chaleur**.\n\nAu tribunal, les juges cherchent des émotions. Mais on ne juge pas une **équation** ! Meursault est logique, froid et précis. C'est tout. Si vous ne comprenez pas ça, sortez de ma classe !\n\n## Section 2: Laboratoire de Vocabulaire\n\n*   **Une masse** (nf): A mass (quantity of matter).\n*   **L’inertie** (nf): Inertia (resistance to change in motion).\n*   **Une force** (nf): A force (interaction that changes the motion of an object).\n*   **Une accélération** (nf): Acceleration (rate of change of velocity).\n*   **Un vecteur** (nm): A vector (quantity having direction as well as magnitude).\n*   **L’optique** (nf): Optics (scientific study of sight and light).\n*   **Une source d’énergie** (nf): An energy source.\n*   **La température** (nf): The temperature.\n*   **Une réflexion** (nf): A reflection (light bouncing off a surface).\n*   **La chaleur** (nf): Heat.\n*   **Une équation** (nf): An equation.\n\n## Section 3: Rappel Actif (Active Recall)\n\n1. Selon la loi de __________, Meursault ne bouge pas sans une force extérieure.\n2. Sur la plage, la lumière frappe le couteau et crée une __________ dans les yeux de Meursault.\n3. Le professeur compare Meursault à une __________ logique, pas à un homme avec des émotions."
  }
]